import random
# 数组stu存储所有学生信息
stu=['卢静雯', '金家慧', '冯若中', '陈熙', '罗思琪', '王宽',\
    '王泓涛', '金逸鑫', '朱佳妮', '吴雅汶', '章佳科', '沈耀晖', \
    '陈湘媛', '赵锦洋', '林乐彤', '蒋欣媛', '杜秀', '詹喜乐', \
    '沈纪中', '朱梦佳', '王开', '王龙宇', '梁嘉忆', '朱昱', \
    '朱家昊', '李宇天', '盛子萌', '张万卿', '蔡京媛', '柳梦凡',\
     '郭一行', '陈康煊', '章航毓', '陈俊杰', '王梓安', '马若里', \
    '张佳瑛', '陈世俊', '李梓盟', '徐毅', '侯湘影', '葛嘉乐', \
    '金礼雅', '朱灵增', '徐浩翔', '李康健', '黄亦勋', '潘奕廷', \
    '朱妍茜', '蒋婧文', '胡珅毓']
n=len(stu)
c=input("输入任意字符时，随机抽取。按下回车或全部学生都被点过名为止:")
while c and n>0:
    num=random.randrange(n)
    # randrange()方法返回范围内随机项
    print(stu[num])
    for i in range(num,n-1):
        stu[i]=stu[i+1]
    n=n-1
    c=input()
if n==0:
    print("所有人均已被点名过")
else:
    print("直接回车，点名结束")
